PANDAS DATA FRAME
Pandas Dataframe is two-dimensional size-mutable, potentially heterogeneous tabular data structure with labeled axes(rows&columns)

In [1]:
import pandas as pd

In [2]:
emp=pd.DataFrame()

In [3]:
print(emp)

Empty DataFrame
Columns: []
Index: []

In [4]:
lst=['a','b','c']
print(lst)

['a', 'b', 'c']

In [5]:
df1=pd.DataFrame(lst)

In [6]:
print(df1)

   0
0  a
1  b
2  c

In [7]:
df1

   0
0  a
1  b
2  c

In [8]:
ls_of_ls=[[1,2,3],[2,3,4],[4,5,6]]
print(ls_of_ls)

[[1, 2, 3], [2, 3, 4], [4, 5, 6]]

In [9]:
df2=pd.DataFrame(ls_of_ls)

In [10]:
df2

   0  1  2
0  1  2  3
1  2  3  4
2  4  5  6

In [11]:
dict1= {'ID':[11,12,13,14,13]}
dict1

{'ID': [11, 12, 13, 14, 13]}

In [12]:
df3=pd.DataFrame(dict1)

In [13]:
df3

   ID
0  11
1  12
2  13
3  14
4  13

In [14]:
dict2= {'ID':[11,12,13,14],'SN':[1,2,3,4]}
dict2

{'ID': [11, 12, 13, 14], 'SN': [1, 2, 3, 4]}

In [15]:
df4=pd.DataFrame(dict2)

In [16]:
df4

   ID  SN
0  11   1
1  12   2
2  13   3
3  14   4

In [17]:
ls_dict=[{'a':1,'b':2},{'a':3,'b':4}]
df5=pd.DataFrame(ls_dict)
df5

   a  b
0  1  2
1  3  4

In [18]:
ls_dict=[{'a':1,'b':2},{'a':3,'b':4,'c':5}]
df5=pd.DataFrame(ls_dict)
df5

   a  b    c
0  1  2  NaN
1  3  4  5.0

In [19]:
dict_sr={"ID":pd.Series([1,2,3]),'SN':pd.Series([111,112,113])}
df6=pd.DataFrame(dict_sr)
df6

   ID   SN
0   1  111
1   2  112
2   3  113